load-tests/results/health-2026-09-03.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/k6/health.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 1 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 1/1 VUs, 1639 complete and 0 interrupted iterations
default   [   2% ] 1/1 VUs  01.0s/50.0s

running (0m02.0s), 1/1 VUs, 2482 complete and 0 interrupted iterations
default   [   4% ] 1/1 VUs  02.0s/50.0s

running (0m03.0s), 1/1 VUs, 3260 complete and 0 interrupted iterations
default   [   6% ] 1/1 VUs  03.0s/50.0s

running (0m04.0s), 1/1 VUs, 3786 complete and 0 interrupted iterations
default   [   8% ] 1/1 VUs  04.0s/50.0s

running (0m05.0s), 1/1 VUs, 4658 complete and 0 interrupted iterations
default   [  10% ] 1/1 VUs  05.0s/50.0s

running (0m06.0s), 1/1 VUs, 5482 complete and 0 interrupted iterations
default   [  12% ] 1/1 VUs  06.0s/50.0s

running (0m07.0s), 1/1 VUs, 6669 complete and 0 interrupted iterations
default   [  14% ] 1/1 VUs  07.0s/50.0s

running (0m08.0s), 1/1 VUs, 8158 complete and 0 interrupted iterations
default   [  16% ] 1/1 VUs  08.0s/50.0s

running (0m09.0s), 1/1 VUs, 9341 complete and 0 interrupted iterations
default   [  18% ] 1/1 VUs  09.0s/50.0s

running (0m10.0s), 1/1 VUs, 10393 complete and 0 interrupted iterations
default   [  20% ] 1/1 VUs  10.0s/50.0s

running (0m11.0s), 1/1 VUs, 11723 complete and 0 interrupted iterations
default   [  22% ] 1/1 VUs  11.0s/50.0s

running (0m12.0s), 1/1 VUs, 12967 complete and 0 interrupted iterations
default   [  24% ] 1/1 VUs  12.0s/50.0s

running (0m13.0s), 1/1 VUs, 14425 complete and 0 interrupted iterations
default   [  26% ] 1/1 VUs  13.0s/50.0s

running (0m14.0s), 1/1 VUs, 15635 complete and 0 interrupted iterations
default   [  28% ] 1/1 VUs  14.0s/50.0s

running (0m15.0s), 1/1 VUs, 17287 complete and 0 interrupted iterations
default   [  30% ] 1/1 VUs  15.0s/50.0s

running (0m16.0s), 1/1 VUs, 18615 complete and 0 interrupted iterations
default   [  32% ] 1/1 VUs  16.0s/50.0s

running (0m17.0s), 1/1 VUs, 19759 complete and 0 interrupted iterations
default   [  34% ] 1/1 VUs  17.0s/50.0s

running (0m18.0s), 1/1 VUs, 21300 complete and 0 interrupted iterations
default   [  36% ] 1/1 VUs  18.0s/50.0s

running (0m19.0s), 1/1 VUs, 22573 complete and 0 interrupted iterations
default   [  38% ] 1/1 VUs  19.0s/50.0s

running (0m20.0s), 1/1 VUs, 23863 complete and 0 interrupted iterations
default   [  40% ] 1/1 VUs  20.0s/50.0s

running (0m21.0s), 1/1 VUs, 25285 complete and 0 interrupted iterations
default   [  42% ] 1/1 VUs  21.0s/50.0s

running (0m22.0s), 1/1 VUs, 26400 complete and 0 interrupted iterations
default   [  44% ] 1/1 VUs  22.0s/50.0s

running (0m23.0s), 1/1 VUs, 27773 complete and 0 interrupted iterations
default   [  46% ] 1/1 VUs  23.0s/50.0s

running (0m24.0s), 1/1 VUs, 28501 complete and 0 interrupted iterations
default   [  48% ] 1/1 VUs  24.0s/50.0s

running (0m25.0s), 1/1 VUs, 29011 complete and 0 interrupted iterations
default   [  50% ] 1/1 VUs  25.0s/50.0s

running (0m26.0s), 1/1 VUs, 29854 complete and 0 interrupted iterations
default   [  52% ] 1/1 VUs  26.0s/50.0s

running (0m27.0s), 1/1 VUs, 30802 complete and 0 interrupted iterations
default   [  54% ] 1/1 VUs  27.0s/50.0s

running (0m28.0s), 1/1 VUs, 31780 complete and 0 interrupted iterations
default   [  56% ] 1/1 VUs  28.0s/50.0s

running (0m29.0s), 1/1 VUs, 32738 complete and 0 interrupted iterations
default   [  58% ] 1/1 VUs  29.0s/50.0s

running (0m30.0s), 1/1 VUs, 33763 complete and 0 interrupted iterations
default   [  60% ] 1/1 VUs  30.0s/50.0s

running (0m31.0s), 1/1 VUs, 34867 complete and 0 interrupted iterations
default   [  62% ] 1/1 VUs  31.0s/50.0s

running (0m32.0s), 1/1 VUs, 36069 complete and 0 interrupted iterations
default   [  64% ] 1/1 VUs  32.0s/50.0s

running (0m33.0s), 1/1 VUs, 37057 complete and 0 interrupted iterations
default   [  66% ] 1/1 VUs  33.0s/50.0s

running (0m34.0s), 1/1 VUs, 38077 complete and 0 interrupted iterations
default   [  68% ] 1/1 VUs  34.0s/50.0s

running (0m35.0s), 1/1 VUs, 39137 complete and 0 interrupted iterations
default   [  70% ] 1/1 VUs  35.0s/50.0s

running (0m36.0s), 1/1 VUs, 40315 complete and 0 interrupted iterations
default   [  72% ] 1/1 VUs  36.0s/50.0s

running (0m37.0s), 1/1 VUs, 41207 complete and 0 interrupted iterations
default   [  74% ] 1/1 VUs  37.0s/50.0s

running (0m38.0s), 1/1 VUs, 42243 complete and 0 interrupted iterations
default   [  76% ] 1/1 VUs  38.0s/50.0s

running (0m39.0s), 1/1 VUs, 43287 complete and 0 interrupted iterations
default   [  78% ] 1/1 VUs  39.0s/50.0s

running (0m40.0s), 1/1 VUs, 44345 complete and 0 interrupted iterations
default   [  80% ] 1/1 VUs  40.0s/50.0s

running (0m41.0s), 1/1 VUs, 45386 complete and 0 interrupted iterations
default   [  82% ] 1/1 VUs  41.0s/50.0s

running (0m42.0s), 1/1 VUs, 46562 complete and 0 interrupted iterations
default   [  84% ] 1/1 VUs  42.0s/50.0s

running (0m43.0s), 1/1 VUs, 47522 complete and 0 interrupted iterations
default   [  86% ] 1/1 VUs  43.0s/50.0s

running (0m44.0s), 1/1 VUs, 48393 complete and 0 interrupted iterations
default   [  88% ] 1/1 VUs  44.0s/50.0s

running (0m45.0s), 1/1 VUs, 49274 complete and 0 interrupted iterations
default   [  90% ] 1/1 VUs  45.0s/50.0s

running (0m46.0s), 1/1 VUs, 50415 complete and 0 interrupted iterations
default   [  92% ] 1/1 VUs  46.0s/50.0s

running (0m47.0s), 1/1 VUs, 51748 complete and 0 interrupted iterations
default   [  94% ] 1/1 VUs  47.0s/50.0s

running (0m48.0s), 1/1 VUs, 53170 complete and 0 interrupted iterations
default   [  96% ] 1/1 VUs  48.0s/50.0s

running (0m49.0s), 1/1 VUs, 54649 complete and 0 interrupted iterations
default   [  98% ] 1/1 VUs  49.0s/50.0s

running (0m50.0s), 1/1 VUs, 56114 complete and 0 interrupted iterations
default   [ 100% ] 1/1 VUs  50.0s/50.0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 56117   1122.32232/s
    checks_succeeded...: 100.00% 56117 out of 56117
    checks_failed......: 0.00%   0 out of 56117

    ✓ returns HTTP 200

    HTTP
    http_req_duration..............: avg=786.08µs min=299.44µs med=687.9µs  max=13.47ms p(90)=1.17ms p(95)=1.47ms
      { expected_response:true }...: avg=786.08µs min=299.44µs med=687.9µs  max=13.47ms p(90)=1.17ms p(95)=1.47ms
    http_req_failed................: 0.00%  0 out of 56117
    http_reqs......................: 56117  1122.32232/s

    EXECUTION
    iteration_duration.............: avg=879.22µs min=336.68µs med=767.77µs max=13.67ms p(90)=1.32ms p(95)=1.65ms
    iterations.....................: 56117  1122.32232/s
    vus............................: 1      min=1          max=1
    vus_max........................: 1      min=1          max=1

    NETWORK
    data_received..................: 9.3 MB 186 kB/s
    data_sent......................: 4.3 MB 85 kB/s



running (0m50.0s), 0/1 VUs, 56117 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/1 VUs  50s