load-tests/results/predict-slots-2026-09-03.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/k6/predict-slots.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 1 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 1/1 VUs, 480 complete and 0 interrupted iterations
default   [   2% ] 1/1 VUs  01.0s/50.0s

running (0m02.0s), 1/1 VUs, 926 complete and 0 interrupted iterations
default   [   4% ] 1/1 VUs  02.0s/50.0s

running (0m03.0s), 1/1 VUs, 1292 complete and 0 interrupted iterations
default   [   6% ] 1/1 VUs  03.0s/50.0s

running (0m04.0s), 1/1 VUs, 1680 complete and 0 interrupted iterations
default   [   8% ] 1/1 VUs  04.0s/50.0s

running (0m05.0s), 1/1 VUs, 2116 complete and 0 interrupted iterations
default   [  10% ] 1/1 VUs  05.0s/50.0s

running (0m06.0s), 1/1 VUs, 2522 complete and 0 interrupted iterations
default   [  12% ] 1/1 VUs  06.0s/50.0s

running (0m07.0s), 1/1 VUs, 2978 complete and 0 interrupted iterations
default   [  14% ] 1/1 VUs  07.0s/50.0s

running (0m08.0s), 1/1 VUs, 3438 complete and 0 interrupted iterations
default   [  16% ] 1/1 VUs  08.0s/50.0s

running (0m09.0s), 1/1 VUs, 3863 complete and 0 interrupted iterations
default   [  18% ] 1/1 VUs  09.0s/50.0s

running (0m10.0s), 1/1 VUs, 4368 complete and 0 interrupted iterations
default   [  20% ] 1/1 VUs  10.0s/50.0s

running (0m11.0s), 1/1 VUs, 4826 complete and 0 interrupted iterations
default   [  22% ] 1/1 VUs  11.0s/50.0s

running (0m12.0s), 1/1 VUs, 5335 complete and 0 interrupted iterations
default   [  24% ] 1/1 VUs  12.0s/50.0s

running (0m13.0s), 1/1 VUs, 5777 complete and 0 interrupted iterations
default   [  26% ] 1/1 VUs  13.0s/50.0s

running (0m14.0s), 1/1 VUs, 6248 complete and 0 interrupted iterations
default   [  28% ] 1/1 VUs  14.0s/50.0s

running (0m15.0s), 1/1 VUs, 6737 complete and 0 interrupted iterations
default   [  30% ] 1/1 VUs  15.0s/50.0s

running (0m16.0s), 1/1 VUs, 7200 complete and 0 interrupted iterations
default   [  32% ] 1/1 VUs  16.0s/50.0s

running (0m17.0s), 1/1 VUs, 7655 complete and 0 interrupted iterations
default   [  34% ] 1/1 VUs  17.0s/50.0s

running (0m18.0s), 1/1 VUs, 8078 complete and 0 interrupted iterations
default   [  36% ] 1/1 VUs  18.0s/50.0s

running (0m19.0s), 1/1 VUs, 8408 complete and 0 interrupted iterations
default   [  38% ] 1/1 VUs  19.0s/50.0s

running (0m20.0s), 1/1 VUs, 8830 complete and 0 interrupted iterations
default   [  40% ] 1/1 VUs  20.0s/50.0s

running (0m21.0s), 1/1 VUs, 9251 complete and 0 interrupted iterations
default   [  42% ] 1/1 VUs  21.0s/50.0s

running (0m22.0s), 1/1 VUs, 9669 complete and 0 interrupted iterations
default   [  44% ] 1/1 VUs  22.0s/50.0s

running (0m23.0s), 1/1 VUs, 10091 complete and 0 interrupted iterations
default   [  46% ] 1/1 VUs  23.0s/50.0s

running (0m24.0s), 1/1 VUs, 10589 complete and 0 interrupted iterations
default   [  48% ] 1/1 VUs  24.0s/50.0s

running (0m25.0s), 1/1 VUs, 11090 complete and 0 interrupted iterations
default   [  50% ] 1/1 VUs  25.0s/50.0s

running (0m26.0s), 1/1 VUs, 11553 complete and 0 interrupted iterations
default   [  52% ] 1/1 VUs  26.0s/50.0s

running (0m27.0s), 1/1 VUs, 11957 complete and 0 interrupted iterations
default   [  54% ] 1/1 VUs  27.0s/50.0s

running (0m28.0s), 1/1 VUs, 12439 complete and 0 interrupted iterations
default   [  56% ] 1/1 VUs  28.0s/50.0s

running (0m29.0s), 1/1 VUs, 12936 complete and 0 interrupted iterations
default   [  58% ] 1/1 VUs  29.0s/50.0s

running (0m30.0s), 1/1 VUs, 13470 complete and 0 interrupted iterations
default   [  60% ] 1/1 VUs  30.0s/50.0s

running (0m31.0s), 1/1 VUs, 13981 complete and 0 interrupted iterations
default   [  62% ] 1/1 VUs  31.0s/50.0s

running (0m32.0s), 1/1 VUs, 14505 complete and 0 interrupted iterations
default   [  64% ] 1/1 VUs  32.0s/50.0s

running (0m33.0s), 1/1 VUs, 14975 complete and 0 interrupted iterations
default   [  66% ] 1/1 VUs  33.0s/50.0s

running (0m34.0s), 1/1 VUs, 15419 complete and 0 interrupted iterations
default   [  68% ] 1/1 VUs  34.0s/50.0s

running (0m35.0s), 1/1 VUs, 15927 complete and 0 interrupted iterations
default   [  70% ] 1/1 VUs  35.0s/50.0s

running (0m36.0s), 1/1 VUs, 16361 complete and 0 interrupted iterations
default   [  72% ] 1/1 VUs  36.0s/50.0s

running (0m37.0s), 1/1 VUs, 16764 complete and 0 interrupted iterations
default   [  74% ] 1/1 VUs  37.0s/50.0s

running (0m38.0s), 1/1 VUs, 17187 complete and 0 interrupted iterations
default   [  76% ] 1/1 VUs  38.0s/50.0s

running (0m39.0s), 1/1 VUs, 17600 complete and 0 interrupted iterations
default   [  78% ] 1/1 VUs  39.0s/50.0s

running (0m40.0s), 1/1 VUs, 18005 complete and 0 interrupted iterations
default   [  80% ] 1/1 VUs  40.0s/50.0s

running (0m41.0s), 1/1 VUs, 18396 complete and 0 interrupted iterations
default   [  82% ] 1/1 VUs  41.0s/50.0s

running (0m42.0s), 1/1 VUs, 18851 complete and 0 interrupted iterations
default   [  84% ] 1/1 VUs  42.0s/50.0s

running (0m43.0s), 1/1 VUs, 19191 complete and 0 interrupted iterations
default   [  86% ] 1/1 VUs  43.0s/50.0s

running (0m44.0s), 1/1 VUs, 19627 complete and 0 interrupted iterations
default   [  88% ] 1/1 VUs  44.0s/50.0s

running (0m45.0s), 1/1 VUs, 20055 complete and 0 interrupted iterations
default   [  90% ] 1/1 VUs  45.0s/50.0s

running (0m46.0s), 1/1 VUs, 20498 complete and 0 interrupted iterations
default   [  92% ] 1/1 VUs  46.0s/50.0s

running (0m47.0s), 1/1 VUs, 20901 complete and 0 interrupted iterations
default   [  94% ] 1/1 VUs  47.0s/50.0s

running (0m48.0s), 1/1 VUs, 21341 complete and 0 interrupted iterations
default   [  96% ] 1/1 VUs  48.0s/50.0s

running (0m49.0s), 1/1 VUs, 21650 complete and 0 interrupted iterations
default   [  98% ] 1/1 VUs  49.0s/50.0s

running (0m50.0s), 1/1 VUs, 22145 complete and 0 interrupted iterations
default   [ 100% ] 1/1 VUs  50.0s/50.0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 22146   442.912509/s
    checks_succeeded...: 100.00% 22146 out of 22146
    checks_failed......: 0.00%   0 out of 22146

    ✓ returns HTTP 200

    HTTP
    http_req_duration..............: avg=2.12ms min=1.13ms med=1.99ms max=21.35ms p(90)=2.68ms p(95)=3.04ms
      { expected_response:true }...: avg=2.12ms min=1.13ms med=1.99ms max=21.35ms p(90)=2.68ms p(95)=3.04ms
    http_req_failed................: 0.00%  0 out of 22146
    http_reqs......................: 22146  442.912509/s

    EXECUTION
    iteration_duration.............: avg=2.24ms min=1.18ms med=2.1ms  max=21.51ms p(90)=2.83ms p(95)=3.21ms
    iterations.....................: 22146  442.912509/s
    vus............................: 1      min=1          max=1
    vus_max........................: 1      min=1          max=1

    NETWORK
    data_received..................: 55 MB  1.1 MB/s
    data_sent......................: 5.7 MB 114 kB/s



running (0m50.0s), 0/1 VUs, 22146 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/1 VUs  50s